InformationRegisters/ЛБ_СтатусыНакладнойНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СтатусыНакладнойНаОтгрузку</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерНакладной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНакладной</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтказОтВыкупа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышеннаяОценка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусНакладной</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыНакладнойНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИзделий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесИзделий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инкассатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пустой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ЛБ_ИсторияНакладной/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("НакладнаяНаОтгрузку") Тогда
		НакладнаяНаОтгрузку = Параметры.НакладнаяНаОтгрузку;
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	Если НЕ ЗначениеЗаполнено(НакладнаяНаОтгрузку) Тогда
		Предупреждение("Не выбрана накладная на отгрузку!", 60);
		Отказ = Истина;
	КонецЕсли;  
	ВывестиИсторию();
КонецПроцедуры

&НаСервере
Процедура ВывестиИсторию()  
	Элементы.ДекорацияНакладная.Заголовок = "История смены статусов накладной № " + СокрЛП(НакладнаяНаОтгрузку.ПредставлениеНомераНакладной) + " от " + Формат(НакладнаяНаОтгрузку.Дата, "ДФ=dd.MM.yyyy" ); 
	Запрос = новый Запрос;    
	Запрос.УстановитьПараметр("НакладнаяНаОтгрузку", НакладнаяНаОтгрузку);  
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыНакладнойНаОтгрузку.Период КАК Дата,
	               |	ЛБ_СтатусыНакладнойНаОтгрузку.СтатусНакладной КАК СтатусНакладной,
	               |	ЛБ_СтатусыНакладнойНаОтгрузку.ОтветственныйСотрудник КАК Ответственный,
	               |	ЛБ_СтатусыНакладнойНаОтгрузку.Комментарий КАК Комментарий
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку КАК ЛБ_СтатусыНакладнойНаОтгрузку
	               |ГДЕ
	               |	ЛБ_СтатусыНакладнойНаОтгрузку.НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку
	               |	И ЛБ_СтатусыНакладнойНаОтгрузку.Пустой = ЛОЖЬ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ИсторияИзменений.Загрузить(ТаблицаЗапроса);
	Для каждого Стр Из ИсторияИзменений Цикл   
		Если Не ЗначениеЗаполнено(Стр.Ответственный) Тогда  
			Стр.Ответственный = "-";
		КонецЕсли;	
	КонецЦикла
КонецПроцедуры
